Revit 2026 API

# ComboBoxAddItem Method

---

Adds a new item to the ComboBox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComboBoxMember AddItem(
	ComboBoxMemberData memberData
)
```
```vb
Public Function AddItem (
	memberData As ComboBoxMemberData
) As ComboBoxMember
```
```cpp
public:
ComboBoxMember^ AddItem(
	ComboBoxMemberData^ memberData
)
```
```fsharp
member AddItem :
        memberData : ComboBoxMemberData -> ComboBoxMember
```

#### Parameters

memberData ComboBoxMemberData
    An object containing the data needed to construct the ComboBoxMember.

#### Return Value

ComboBoxMember The newly added ComboBoxMember.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when memberData is . |
| ArgumentException | Thrown when button with memberData.Name already exists in the drop-down list. |

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace